In [1]:
import pandas as pd

In [20]:
#leer los archivos 
data = pd.read_csv('ejemplo_datos.csv')
#el argumento es el documento a leer
#metodo para leer excels
#data = pd.read_excel('ejemplo.csv')

In [14]:
#metodos orientados al analisis de datos
#vizualizar la cabezera de los datos guardados en la variable
data.head()
#muestra los primero 5 datos

  Nombre  Edad     Ciudad
0    Ana    23     Madrid
1   Luis    34  Barcelona
2  Pedro    45   Valencia
3  Marta    28    Sevilla
4  Sofía    32     Bilbao

In [15]:
#puedo indicar cuantos datos quiero visualizar
data.head(1)

  Nombre  Edad  Ciudad
0    Ana    23  Madrid

In [16]:
data.shape
#muesta las columnas y filas que lo integran

(5, 3)

In [17]:
data.info()
#informacion de los datos y sus tipos de datos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nombre  5 non-null      object
 1   Edad    5 non-null      int64
 2   Ciudad  5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [18]:
data.describe()
#funcion que saca estadisticas basicas de los datos

            Edad
count   5.000000
mean   32.400000
std     8.203658
min    23.000000
25%    28.000000
50%    32.000000
75%    34.000000
max    45.000000

In [19]:
#guardar los datos
data.to_csv('cambiosguardados.csv')